# Thickness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsLandingType..::..Thickness Property
StairsLandingType Class See Also
---
Thickness of the stairs landing.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Thickness { get; set; }
```

Visual Basic
---
```text
Public Property Thickness As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Thickness {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for thickness must be greater than 0 and no more than 30000 feet. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The landing type doesn't have monolithic support. |

# See Also
StairsLandingType Class
Autodesk.Revit.DB.Architecture Namespace